-- phpMyAdmin SQL Dump
-- version phpStudy 2014
-- http://www.phpmyadmin.net
--
-- 主机: localhost
-- 生成日期: 2016 �?04 �?04 �?01:01
-- 服务器版本: 5.5.40
-- PHP 版本: 5.6.1

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- 数据库: `webchat`
--

-- --------------------------------------------------------

--
-- 表的结构 `message`
--

CREATE TABLE IF NOT EXISTS `message` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `sender` varchar(64) CHARACTER SET utf8 DEFAULT NULL,
  `getter` varchar(64) CHARACTER SET utf8 DEFAULT NULL,
  `content` varchar(3600) CHARACTER SET utf8 DEFAULT NULL,
  `sendTime` datetime DEFAULT NULL,
  `isGet` tinyint(4) DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=gbk AUTO_INCREMENT=45 ;

--
-- 转存表中的数据 `message`
--

INSERT INTO `message` (`id`, `sender`, `getter`, `content`, `sendTime`, `isGet`) VALUES
(11, '王新育', '聂小倩', '你好', '2016-04-03 09:22:36', 1),
(12, '王新育', '聂小倩', '请问，你是聂小倩吗？', '2016-04-03 09:23:31', 1),
(10, '鐜嬫柊鑲', '鑱傚皬鍊', '娴嬭瘯锛屽笇鏈涙?甯', '2016-04-03 09:18:36', 0),
(9, '聂小倩', '王新育', '你好，我是聂小倩', '2016-04-03 09:17:46', 1),
(1, '王新育', '聂小倩', '你好，我是王新育', NULL, 1),
(13, '王新育', '聂小倩', '你好', '2016-04-03 09:57:14', 1),
(14, '王新育', '聂小倩', '你好', '2016-04-03 10:07:54', 1),
(15, '王新育', '傅清风', '时间', '2016-04-03 10:08:16', 0),
(16, 'hpuwxy', '聂小倩', '你好', '2016-04-03 10:10:43', 0),
(17, 'hpuwxy', '姥姥', '姥姥你好', '2016-04-03 10:11:53', 0),
(18, '王新育', '傅清风', '清风你好。', '2016-04-03 10:14:11', 0),
(19, 'hpuwxy', '董小卓', '年后', '2016-04-03 10:15:35', 0),
(20, '王新育', '宁采臣', '宁采臣你好', '2016-04-03 10:31:05', 0),
(21, 'hpuwxy', '聂小倩', 'niaho ', '2016-04-03 10:41:44', 0),
(22, 'hpuwxy', '傅清风', '数组', '2016-04-03 10:48:13', 0),
(23, '王新育', '姥姥', '你是', '2016-04-03 12:28:44', 0),
(24, '王新育', '聂小倩', '你是', '2016-04-03 12:37:26', 1),
(25, '王新育', '聂小倩', '王新育你好', '2016-04-03 12:45:26', 1),
(26, '王新育', '姥姥', '你是', '2016-04-03 13:00:36', 0),
(27, '王新育', '聂小倩', '你好', '2016-04-03 13:05:26', 1),
(28, '王新育', '聂小倩', '你也好', '2016-04-03 13:06:37', 1),
(29, '王新育', '聂小倩', '王新育是发送人', '2016-04-03 13:09:35', 1),
(30, '聂小倩', '王新育', '聂小倩是发送人', '2016-04-03 13:10:22', 1),
(31, '聂小倩', '王新育', '聂小倩你好', '2016-04-03 13:11:27', 1),
(32, '聂小倩', '王新育', '王新育你也好啊', '2016-04-03 13:11:42', 1),
(33, '聂小倩', '王新育', '王新育你好', '2016-04-03 13:12:38', 1),
(34, '王新育', '聂小倩', '你好', '2016-04-03 14:41:25', 1),
(35, '聂小倩', '王新育', '你也好', '2016-04-03 14:41:46', 1),
(36, '聂小倩', '聂小倩', '', '2016-04-03 14:47:21', 0),
(37, '王新育', '聂小倩', '你是不是王祖贤？', '2016-04-04 00:47:17', 1),
(38, '王新育', '聂小倩', '王新育对聂小倩说', '2016-04-04 00:49:36', 1),
(39, '王新育', '聂小倩', 'google王新育', '2016-04-04 00:53:26', 1),
(40, '王新育', '聂小倩', '用火狐测试', '2016-04-04 00:54:12', 1),
(41, '王新育', '聂小倩', 'toLocalstring', '2016-04-04 00:54:53', 1),
(42, '王新育', '聂小倩', '这一次应该成功了', '2016-04-04 00:56:12', 1),
(43, '王新育', '聂小倩', '你好，我是王新育', '2016-04-04 00:58:24', 1),
(44, '聂小倩', '王新育', '你好，我是聂小倩', '2016-04-04 00:58:37', 1);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
